---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotDragWitnessLine
source: html/1e45c4a4-6326-724b-4c4c-aa31582b8794.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotDragWitnessLine Property

Moving the Witness Line conflicts with other Constraints in the Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDragWitnessLine { get; }
```